letters = [
    "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M",
    "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z",
    "0", "1", "2", "3", "4", "5", "6", "7", "8", "9"
]

morse = [
    ".-", "-...", "-.-.", "-..", ".", "..-.", "--.", "....", "..", ".---", "-.-", ".-..", "--",
    "-.", "---", ".--.", "--.-", ".-.", "...", "-", "..-", "...-", ".--", "-..-", "-.--", "--..",
    "-----", ".----", "..---", "...--", "....-", ".....", "-....", "--...", "---..", "----."
]

text = input("請輸入文字:").upper()
result = ""

for char in text:
    # 情況 A: 如果是空白，我們手動換成 "/"
    if char == " ":
        result += "/"
    # 情況 B: 如果在列表中 (包含字母和數字)
    elif char in letters:
        idx = letters.index(char)
        code = morse[idx]
        result += code + " "
    # 情況 C: 未知符號
    else:
        result += "? "  # 用問號代表無法翻譯

print(f"翻譯結果：{result}")